restaurant > week_1_sales.csv
restaurant > week_2_sales.csv

In [50]:
import pandas as pd

In [51]:
w1 = pd.read_csv('./datasets/task_1/restaurant/week_1_sales.csv')
w2 = pd.read_csv('./datasets/task_1/restaurant/week_2_sales.csv')
customer = pd.read_csv('./datasets/task_1/restaurant/customers.csv')

1. concatenate the two weeks of sales data into one DataFrame
 - assign the week1 DataFrame a key of "Week 1" and the week2 DataFrame a key of "Week 2"

In [52]:
combined = pd.concat([w1, w2], keys = ["Week 1", "Week 2"])
combined

            Customer ID  Food ID
Week 1 0            537        9
       1             97        4
       2            658        1
       3            202        2
       4            155        9
...                 ...      ...
Week 2 245          783       10
       246          556       10
       247          547        9
       248          252        9
       249          249        6

[500 rows x 2 columns]

2. find the customers who ate at the restaurant both weeks

In [53]:
both = pd.merge(w1, w2, how = "inner", on = "Customer ID").drop_duplicates(subset = ["Customer ID"])
both

    Customer ID  Food ID_x  Food ID_y
0           537          9          5
1           155          9          3
2           503          5          8
5           550          6          7
6           101          7          4
7            75          6          4
8            77          1          7
9           628          4          7
10          798          9          5
11          462          3          8
12          304          3          3
13          189          4          5
14          799          8          7
15           30          2          4
16          249          9          6
17          677         10          3
18          741          3          8
19          540          3          3
20          819          4          5
21          937         10         10
23          233          3          3
24           21          4          4
25          459          6          1
26          816          7          2
27          761          9          2
30           80          2          4
31          479          6          3
32          922          1          1
34          909          1          6
35          919         10          8
37          574         10          9
38           45          7          8
40          529          7         10
41          673          7          4
42          310          2          5
43          867          9         10
44          968          1          4
46          482          3          1
47          163          1         10
48          321          1          3
51          783          6         10
53          578          5          5
56          520          8          7
57          945          5          4
58          343          3          5
61          621          9          6

3. find the customers who ate at the restaurant both weeks and ordered the same item each week

In [54]:
same_item = pd.merge(w1, w2, how = "inner", on = ["Customer ID", "Food ID"]).drop_duplicates(subset = ["Customer ID"])
same_item

   Customer ID  Food ID
0          304        3
1          540        3
2          937       10
3          233        3
4           21        4
5          922        1
7          578        5

4. Identify which customers came in only on Week 1 and only on Week 2.

In [58]:
w1only = w1[~(w1["Customer ID"].isin(w2["Customer ID"]))]
w1only

     Customer ID  Food ID
1             97        4
2            658        1
3            202        2
5            213        8
6            600        1
..           ...      ...
245          413        9
246          926        6
247          134        3
248          396        6
249          535       10

[195 rows x 2 columns]

5. Each row in the week1 DataFrame identifies a customer who purchased a food item. For each row, pull in the customerâ€™s information from the customer's DataFrame.

In [57]:
new_w1 = pd.merge(w1, customer, how = "inner", left_on = "Customer ID", right_on = "ID")
new_w1

,Customer ID,Food ID,ID,First Name,Last Name,Gender,Company,Occupation
0,537,9,537,Cheryl,Carroll,Female,Zoombeat,Registered Nurse
1,97,4,97,Amanda,Watkins,Female,Ozu,Account Coordinator
2,658,1,658,Patrick,Webb,Male,Browsebug,Community Outreach Specialist
3,202,2,202,Louis,Campbell,Male,Rhynoodle,Account Representative III
4,155,9,155,Carolyn,Diaz,Female,Gigazoom,Database Administrator III
...,...,...,...,...,...,...,...,...
245,413,9,413,Diane,Bailey,Female,Wikibox,Technical Writer
246,926,6,926,Anne,Wagner,Female,Skyba,Legal Assistant
247,134,3,134,Diana,Hall,Female,Quinu,Financial Advisor
248,396,6,396,Juan,Romero,Male,Zoonder,Analyst Programmer
249,535,10,535,Nancy,Cox,Female,Trudeo,Research Associate